Revit 2027 API
TableSectionData.InsertColumn Method
 Inserts a new column at the specified index relative to the current set of columns.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void InsertColumn(
	int index
)
Public Sub InsertColumn (
	index As Integer
)
public:
void InsertColumn(
	int index
)
member InsertColumn :
        index : int -> unit
Parameters
index Int32
 An integer index.
Exceptions
Exception | Condition
ArgumentException |  index is invalid index.
InvalidOperationException |  This operation is forbidden for cells in standard schedule body sections.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace